Praktikum 7/PRAK701/app/Controllers/CRUDController.php

    public function index()
    {
        $model = new BukuModel();
        $semuaData = $model->findAll();
---
SELECT *
FROM `buku`

    public function simpan()
    {
        if(!$this->validate('validasiBuku')){
            return redirect()->back()->withInput();
        }

        $judul = $this->request->getPost('judul');
        $penulis = $this->request->getPost('penulis');
        $penerbit = $this->request->getPost('penerbit');
        $tahun_terbit = $this->request->getPost('tahun_terbit');

        $model = new BukuModel();
        $model->insert([
            "judul" => $judul,
            "penulis" => $penulis,
            "penerbit" => $penerbit,
            "tahun_terbit" => $tahun_terbit,
        ]);
---
INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`) VALUES ('buku4', 'penulis4', 'penerbit5', '2023')

    public function edit($id)
    {
        $model = new BukuModel();
        $data = $model->find($id);
---
SELECT *
FROM `buku`
WHERE `buku`.`id` = '9'

    public function hapus($id)
    {
        $model = new BukuModel();
        $model->delete($id);
---
DELETE FROM `buku`
WHERE `id` IN ('7')